# SurfaceSplitError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..SurfaceSplitError Property
BuiltInFailures..::..SiteFailures Class See Also
---
The splitting boundary must split the Surface into exactly two pieces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SurfaceSplitError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfaceSplitError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SurfaceSplitError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace